[
  "obsidian-banners",
  "calendar",
  "obsidian-checklist-plugin",
  "code-styler",
  "templater-obsidian",
  "obsidian-tasks-plugin",
  "obsidian-style-settings",
  "multi-column-markdown",
  "obsidian-list-callouts",
  "obsidian-latex-suite",
  "homepage",
  "obsidian-full-calendar",
  "dataview",
  "contribution-graph"
]